_protected/common/models/User.php

    public static function userExists($email, $password, $scenario)
    {
        if ($user = static::findOne(['email' => $email]))
---
SELECT * FROM `user` WHERE `email` IS NULL